MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAK169/mcu.h
#define _CNPUJ_CNPUJ9_POSITION                   0x00000009
#define _CNPUJ_CNPUJ9_MASK                       0x00000200
#define _CNPUJ_CNPUJ9_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ10_POSITION                  0x0000000A
#define _CNPUJ_CNPUJ10_MASK                      0x00000400
#define _CNPUJ_CNPUJ10_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ11_POSITION                  0x0000000B
#define _CNPUJ_CNPUJ11_MASK                      0x00000800
#define _CNPUJ_CNPUJ11_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ12_POSITION                  0x0000000C
#define _CNPUJ_CNPUJ12_MASK                      0x00001000
#define _CNPUJ_CNPUJ12_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ13_POSITION                  0x0000000D
#define _CNPUJ_CNPUJ13_MASK                      0x00002000
#define _CNPUJ_CNPUJ13_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ14_POSITION                  0x0000000E
#define _CNPUJ_CNPUJ14_MASK                      0x00004000
#define _CNPUJ_CNPUJ14_LENGTH                    0x00000001

#define _CNPUJ_CNPUJ15_POSITION                  0x0000000F
#define _CNPUJ_CNPUJ15_MASK                      0x00008000
#define _CNPUJ_CNPUJ15_LENGTH                    0x00000001

#define _CNPUJ_w_POSITION                        0x00000000
#define _CNPUJ_w_MASK                            0xFFFFFFFF
#define _CNPUJ_w_LENGTH                          0x00000020

#define _CNPDJ_CNPDJ0_POSITION                   0x00000000
#define _CNPDJ_CNPDJ0_MASK                       0x00000001
#define _CNPDJ_CNPDJ0_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ1_POSITION                   0x00000001
#define _CNPDJ_CNPDJ1_MASK                       0x00000002
#define _CNPDJ_CNPDJ1_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ2_POSITION                   0x00000002
#define _CNPDJ_CNPDJ2_MASK                       0x00000004
#define _CNPDJ_CNPDJ2_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ3_POSITION                   0x00000003
#define _CNPDJ_CNPDJ3_MASK                       0x00000008
#define _CNPDJ_CNPDJ3_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ4_POSITION                   0x00000004
#define _CNPDJ_CNPDJ4_MASK                       0x00000010
#define _CNPDJ_CNPDJ4_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ5_POSITION                   0x00000005
#define _CNPDJ_CNPDJ5_MASK                       0x00000020
#define _CNPDJ_CNPDJ5_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ6_POSITION                   0x00000006
#define _CNPDJ_CNPDJ6_MASK                       0x00000040
#define _CNPDJ_CNPDJ6_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ7_POSITION                   0x00000007
#define _CNPDJ_CNPDJ7_MASK                       0x00000080
#define _CNPDJ_CNPDJ7_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ8_POSITION                   0x00000008
#define _CNPDJ_CNPDJ8_MASK                       0x00000100
#define _CNPDJ_CNPDJ8_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ9_POSITION                   0x00000009
#define _CNPDJ_CNPDJ9_MASK                       0x00000200
#define _CNPDJ_CNPDJ9_LENGTH                     0x00000001

#define _CNPDJ_CNPDJ10_POSITION                  0x0000000A
#define _CNPDJ_CNPDJ10_MASK                      0x00000400
#define _CNPDJ_CNPDJ10_LENGTH                    0x00000001

#define _CNPDJ_CNPDJ11_POSITION                  0x0000000B
#define _CNPDJ_CNPDJ11_MASK                      0x00000800
#define _CNPDJ_CNPDJ11_LENGTH                    0x00000001

#define _CNPDJ_CNPDJ12_POSITION                  0x0000000C
#define _CNPDJ_CNPDJ12_MASK                      0x00001000
#define _CNPDJ_CNPDJ12_LENGTH                    0x00000001

#define _CNPDJ_CNPDJ13_POSITION                  0x0000000D
#define _CNPDJ_CNPDJ13_MASK                      0x00002000
#define _CNPDJ_CNPDJ13_LENGTH                    0x00000001

#define _CNPDJ_CNPDJ14_POSITION                  0x0000000E
#define _CNPDJ_CNPDJ14_MASK                      0x00004000
#define _CNPDJ_CNPDJ14_LENGTH                    0x00000001

#define _CNPDJ_CNPDJ15_POSITION                  0x0000000F
#define _CNPDJ_CNPDJ15_MASK                      0x00008000
#define _CNPDJ_CNPDJ15_LENGTH                    0x00000001

#define _CNPDJ_w_POSITION                        0x00000000
#define _CNPDJ_w_MASK                            0xFFFFFFFF
#define _CNPDJ_w_LENGTH                          0x00000020

#define _CNCONJ_EDGEDETECT_POSITION              0x0000000B
#define _CNCONJ_EDGEDETECT_MASK                  0x00000800
#define _CNCONJ_EDGEDETECT_LENGTH                0x00000001

#define _CNCONJ_ON_POSITION                      0x0000000F
#define _CNCONJ_ON_MASK                          0x00008000
#define _CNCONJ_ON_LENGTH                        0x00000001

#define _CNCONJ_w_POSITION                       0x00000000
#define _CNCONJ_w_MASK                           0xFFFFFFFF
#define _CNCONJ_w_LENGTH                         0x00000020

#define _CNENJ_CNIEJ0_POSITION                   0x00000000
#define _CNENJ_CNIEJ0_MASK                       0x00000001
#define _CNENJ_CNIEJ0_LENGTH                     0x00000001

#define _CNENJ_CNIEJ1_POSITION                   0x00000001
#define _CNENJ_CNIEJ1_MASK                       0x00000002
#define _CNENJ_CNIEJ1_LENGTH                     0x00000001

#define _CNENJ_CNIEJ2_POSITION                   0x00000002
#define _CNENJ_CNIEJ2_MASK                       0x00000004
#define _CNENJ_CNIEJ2_LENGTH                     0x00000001

#define _CNENJ_CNIEJ3_POSITION                   0x00000003
#define _CNENJ_CNIEJ3_MASK                       0x00000008
#define _CNENJ_CNIEJ3_LENGTH                     0x00000001

#define _CNENJ_CNIEJ4_POSITION                   0x00000004
#define _CNENJ_CNIEJ4_MASK                       0x00000010
#define _CNENJ_CNIEJ4_LENGTH                     0x00000001

#define _CNENJ_CNIEJ5_POSITION                   0x00000005
#define _CNENJ_CNIEJ5_MASK                       0x00000020
#define _CNENJ_CNIEJ5_LENGTH                     0x00000001

#define _CNENJ_CNIEJ6_POSITION                   0x00000006
#define _CNENJ_CNIEJ6_MASK                       0x00000040
#define _CNENJ_CNIEJ6_LENGTH                     0x00000001

#define _CNENJ_CNIEJ7_POSITION                   0x00000007
#define _CNENJ_CNIEJ7_MASK                       0x00000080
#define _CNENJ_CNIEJ7_LENGTH                     0x00000001

#define _CNENJ_CNIEJ8_POSITION                   0x00000008
#define _CNENJ_CNIEJ8_MASK                       0x00000100
#define _CNENJ_CNIEJ8_LENGTH                     0x00000001

#define _CNENJ_CNIEJ9_POSITION                   0x00000009
#define _CNENJ_CNIEJ9_MASK                       0x00000200
#define _CNENJ_CNIEJ9_LENGTH                     0x00000001

#define _CNENJ_CNIEJ10_POSITION                  0x0000000A
#define _CNENJ_CNIEJ10_MASK                      0x00000400
#define _CNENJ_CNIEJ10_LENGTH                    0x00000001

#define _CNENJ_CNIEJ11_POSITION                  0x0000000B
#define _CNENJ_CNIEJ11_MASK                      0x00000800
#define _CNENJ_CNIEJ11_LENGTH                    0x00000001

#define _CNENJ_CNIEJ12_POSITION                  0x0000000C
#define _CNENJ_CNIEJ12_MASK                      0x00001000
#define _CNENJ_CNIEJ12_LENGTH                    0x00000001

#define _CNENJ_CNIEJ13_POSITION                  0x0000000D
#define _CNENJ_CNIEJ13_MASK                      0x00002000
#define _CNENJ_CNIEJ13_LENGTH                    0x00000001

