MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAK169/mcu.h
#define _USBLMPR2_LPMFADDR_POSITION              0x00000008
#define _USBLMPR2_LPMFADDR_MASK                  0x00007F00
#define _USBLMPR2_LPMFADDR_LENGTH                0x00000007

#define _USBLPMP2_LPMST_POSITION                 0x00000000
#define _USBLPMP2_LPMST_MASK                     0x00000001
#define _USBLPMP2_LPMST_LENGTH                   0x00000001

#define _USBLPMP2_LPMNY_POSITION                 0x00000001
#define _USBLPMP2_LPMNY_MASK                     0x00000002
#define _USBLPMP2_LPMNY_LENGTH                   0x00000001

#define _USBLPMP2_LPMACK_POSITION                0x00000002
#define _USBLPMP2_LPMACK_MASK                    0x00000004
#define _USBLPMP2_LPMACK_LENGTH                  0x00000001

#define _USBLPMP2_LPMNC_POSITION                 0x00000003
#define _USBLPMP2_LPMNC_MASK                     0x00000008
#define _USBLPMP2_LPMNC_LENGTH                   0x00000001

#define _USBLPMP2_LPMRES_POSITION                0x00000004
#define _USBLPMP2_LPMRES_MASK                    0x00000010
#define _USBLPMP2_LPMRES_LENGTH                  0x00000001

#define _USBLPMP2_LPMERR_POSITION                0x00000005
#define _USBLPMP2_LPMERR_MASK                    0x00000020
#define _USBLPMP2_LPMERR_LENGTH                  0x00000001

#define _USBLPMP2_LPMFADDR_POSITION              0x00000008
#define _USBLPMP2_LPMFADDR_MASK                  0x00007F00
#define _USBLPMP2_LPMFADDR_LENGTH                0x00000007

#define _RNGVER_REVISION_POSITION                0x00000000
#define _RNGVER_REVISION_MASK                    0x0000007F
#define _RNGVER_REVISION_LENGTH                  0x00000007

#define _RNGVER_VERSION_POSITION                 0x00000007
#define _RNGVER_VERSION_MASK                     0x0000FF80
#define _RNGVER_VERSION_LENGTH                   0x00000009

#define _RNGVER_ID_POSITION                      0x00000010
#define _RNGVER_ID_MASK                          0xFFFF0000
#define _RNGVER_ID_LENGTH                        0x00000010

#define _RNGCON_PLEN_POSITION                    0x00000000
#define _RNGCON_PLEN_MASK                        0x000000FF
#define _RNGCON_PLEN_LENGTH                      0x00000008

#define _RNGCON_TRNGEN_POSITION                  0x00000008
#define _RNGCON_TRNGEN_MASK                      0x00000100
#define _RNGCON_TRNGEN_LENGTH                    0x00000001

#define _RNGCON_PRNGEN_POSITION                  0x00000009
#define _RNGCON_PRNGEN_MASK                      0x00000200
#define _RNGCON_PRNGEN_LENGTH                    0x00000001

#define _RNGCON_CONT_POSITION                    0x0000000A
#define _RNGCON_CONT_MASK                        0x00000400
#define _RNGCON_CONT_LENGTH                      0x00000001

#define _RNGCON_TRNGMODE_POSITION                0x0000000B
#define _RNGCON_TRNGMODE_MASK                    0x00000800
#define _RNGCON_TRNGMODE_LENGTH                  0x00000001

#define _RNGCON_LOAD_POSITION                    0x0000000C
#define _RNGCON_LOAD_MASK                        0x00001000
#define _RNGCON_LOAD_LENGTH                      0x00000001

#define _RNGPOLY1_POLY_POSITION                  0x00000000
#define _RNGPOLY1_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY1_POLY_LENGTH                    0x00000020

#define _RNGPOLY2_POLY_POSITION                  0x00000000
#define _RNGPOLY2_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY2_POLY_LENGTH                    0x00000020

#define _RNGNUMGEN1_RNG_POSITION                 0x00000000
#define _RNGNUMGEN1_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN1_RNG_LENGTH                   0x00000020

#define _RNGNUMGEN2_RNG_POSITION                 0x00000000
#define _RNGNUMGEN2_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN2_RNG_LENGTH                   0x00000020

#define _RNGSEED1_SEED_POSITION                  0x00000000
#define _RNGSEED1_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED1_SEED_LENGTH                    0x00000020

#define _RNGSEED2_SEED_POSITION                  0x00000000
#define _RNGSEED2_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED2_SEED_LENGTH                    0x00000020

#define _RNGCNT_RCNT_POSITION                    0x00000000
#define _RNGCNT_RCNT_MASK                        0x0000007F
#define _RNGCNT_RCNT_LENGTH                      0x00000007

#define _GLCDMODE_RGBSEQ_POSITION                0x00000005
#define _GLCDMODE_RGBSEQ_MASK                    0x000000E0
#define _GLCDMODE_RGBSEQ_LENGTH                  0x00000003

#define _GLCDMODE_FORMATCLK_POSITION             0x00000008
#define _GLCDMODE_FORMATCLK_MASK                 0x00000100
#define _GLCDMODE_FORMATCLK_LENGTH               0x00000001

#define _GLCDMODE_YUVOUTPUT_POSITION             0x00000009
#define _GLCDMODE_YUVOUTPUT_MASK                 0x00000200
#define _GLCDMODE_YUVOUTPUT_LENGTH               0x00000001

#define _GLCDMODE_FORCEBLANK_POSITION            0x00000013
#define _GLCDMODE_FORCEBLANK_MASK                0x00080000
#define _GLCDMODE_FORCEBLANK_LENGTH              0x00000001

#define _GLCDMODE_PGRAMPEN_POSITION              0x00000014
#define _GLCDMODE_PGRAMPEN_MASK                  0x00100000
#define _GLCDMODE_PGRAMPEN_LENGTH                0x00000001

#define _GLCDMODE_PCLKPOL_POSITION               0x00000016
#define _GLCDMODE_PCLKPOL_MASK                   0x00400000
#define _GLCDMODE_PCLKPOL_LENGTH                 0x00000001

#define _GLCDMODE_VSYNCCYC_POSITION              0x00000017
#define _GLCDMODE_VSYNCCYC_MASK                  0x00800000
#define _GLCDMODE_VSYNCCYC_LENGTH                0x00000001

#define _GLCDMODE_DITHER_POSITION                0x00000018
#define _GLCDMODE_DITHER_MASK                    0x01000000
#define _GLCDMODE_DITHER_LENGTH                  0x00000001

#define _GLCDMODE_DEPOL_POSITION                 0x0000001A
#define _GLCDMODE_DEPOL_MASK                     0x04000000
#define _GLCDMODE_DEPOL_LENGTH                   0x00000001

#define _GLCDMODE_HSYNCPOL_POSITION              0x0000001B
#define _GLCDMODE_HSYNCPOL_MASK                  0x08000000
#define _GLCDMODE_HSYNCPOL_LENGTH                0x00000001

#define _GLCDMODE_VSYNCPOL_POSITION              0x0000001C
#define _GLCDMODE_VSYNCPOL_MASK                  0x10000000
#define _GLCDMODE_VSYNCPOL_LENGTH                0x00000001

#define _GLCDMODE_CURSOREN_POSITION              0x0000001E
#define _GLCDMODE_CURSOREN_MASK                  0x40000000
#define _GLCDMODE_CURSOREN_LENGTH                0x00000001

